---
kind: method
id: M:Autodesk.Revit.DB.FormArray.#ctor
source: html/228ff322-d72c-c249-6101-dc7fabd4e25e.htm
---
# Autodesk.Revit.DB.FormArray.#ctor Method

Initializes a new instance of the FormArray class

## Syntax (C#)
```csharp
public FormArray()
```